BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega128RFA1.PIC
        <edc:AdjustPoint edc:_addr="0x93" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x94" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT3" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x96" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR3" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x98" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR3A" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x9A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR3B" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x9C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR3C" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:AdjustPoint edc:_addr="0x9E" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xA0" edc:access="nnnnnnnn" edc:cname="TCCR4A" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WGM4" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Normal mode of operation" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="PWM, phase correct, 8-bit" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="PWM, phase correct, 9-bit" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x3" edc:desc="PWM, phase correct, 10-bit" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="Fast PWM, 8-bit" edc:when="(field &amp; 0x3) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Fast PWM, 9-bit" edc:when="(field &amp; 0x3) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Fast PWM, 10-bit" edc:when="(field &amp; 0x3) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x8" edc:desc="PWM, Phase and frequency correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x9" edc:desc="PWM, Phase and frequency correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA" edc:desc="PWM, Phase correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xA"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB" edc:desc="PWM, Phase correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xB"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xC"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xD" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0xD"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="Fast PWM, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Fast PWM, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM4C" edc:desc="Compare Output Mode for Channel C" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM4B" edc:desc="Compare Output Mode for Channel B" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM4A" edc:desc="Compare Output Mode for Channel A" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA1" edc:access="nnnnnnnn" edc:cname="TCCR4B" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS4" edc:desc="Clock Select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No clock source (Timer/Counter stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="clk_IO/1 (no prescaling)" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="clk_IO/8 (from prescaler)" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="clk_IO/64 (from prescaler)" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="clk_IO/256 (from prescaler)" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="clk_IO/1024 (from prescaler)" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WGM4" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Normal mode of operation" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="PWM, phase correct, 8-bit" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="PWM, phase correct, 9-bit" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x3" edc:desc="PWM, phase correct, 10-bit" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="Fast PWM, 8-bit" edc:when="(field &amp; 0x3) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Fast PWM, 9-bit" edc:when="(field &amp; 0x3) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Fast PWM, 10-bit" edc:when="(field &amp; 0x3) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x8" edc:desc="PWM, Phase and frequency correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x9" edc:desc="PWM, Phase and frequency correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA" edc:desc="PWM, Phase correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xA"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB" edc:desc="PWM, Phase correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xB"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xC"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xD" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0xD"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="Fast PWM, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Fast PWM, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES4" edc:desc="Input Capture 4 Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC4" edc:desc="Input Capture 4 Noise Canceller" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA2" edc:access="nnnnnnnn" edc:cname="TCCR4C" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="FOC4C" edc:desc="Force Output Compare for Channel C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC4B" edc:desc="Force Output Compare for Channel B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC4A" edc:desc="Force Output Compare for Channel A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xA3" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xA4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT4" edc:nzwidth="0x10" ltx:memberofperipheral="TC4"/>
        <edc:SFRDef edc:_addr="0xA6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR4" edc:nzwidth="0x10" ltx:memberofperipheral="TC4"/>
        <edc:SFRDef edc:_addr="0xA8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR4A" edc:nzwidth="0x10" ltx:memberofperipheral="TC4"/>
        <edc:SFRDef edc:_addr="0xAA" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR4B" edc:nzwidth="0x10" ltx:memberofperipheral="TC4"/>
        <edc:SFRDef edc:_addr="0xAC" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR4C" edc:nzwidth="0x10" ltx:memberofperipheral="TC4"/>
        <edc:AdjustPoint edc:_addr="0xAE" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xB0" edc:access="nnnnnnnn" edc:cname="TCCR2A" edc:nzwidth="0x8" ltx:memberofperipheral="TC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WGM2" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Normal mode of operation" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="PWM, phase correct, TOP=0xFF" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="CTC, TOP = OCRA" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x3" edc:desc="Fast PWM, TOP=0xFF" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="PWM, Phase correct, TOP = OCRA" edc:when="(field &amp; 0x3) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Fast PWM, TOP=OCRA" edc:when="(field &amp; 0x3) == 0x7"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="COM2B" edc:desc="Compare Match Output B Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal port operation, OC2B disconnected" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Toggle OC2B on Compare Match" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Clear OC2B on Compare Match" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Set OC2B on Compare Match" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM2A" edc:desc="Compare Match Output A Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal port operation, OC2A disconnected" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Toggle OC2A on Compare Match" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Clear OC2A on Compare Match" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Set OC2A on Compare Match" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB1" edc:access="nnnnnnnn" edc:cname="TCCR2B" edc:nzwidth="0x8" ltx:memberofperipheral="TC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS2" edc:desc="Clock Select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No clock source (Timer/Counter2 stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="clk_T2S/1 (no prescaling)" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="clk_T2S/8 (from prescaler)" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="clk_T2S/32 (from prescaler)" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="clk_T2S/64 (from prescaler)" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="clk_T2S/128 (from prescaler)" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="clk_T2S/256 (from prescaler)" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="clk_T2S/1024 (from prescaler)" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WGM22" edc:desc="Waveform Generation Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FOC2B" edc:desc="Force Output Compare B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC2A" edc:desc="Force Output Compare A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB2" edc:access="nnnnnnnn" edc:cname="TCNT2" edc:nzwidth="0x8" ltx:memberofperipheral="TC2"/>
        <edc:SFRDef edc:_addr="0xB3" edc:access="nnnnnnnn" edc:cname="OCR2A" edc:nzwidth="0x8" ltx:memberofperipheral="TC2"/>
        <edc:SFRDef edc:_addr="0xB4" edc:access="nnnnnnnn" edc:cname="OCR2B" edc:nzwidth="0x8" ltx:memberofperipheral="TC2"/>
        <edc:AdjustPoint edc:_addr="0xB5" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xB6" edc:access="nnnnnnnn" edc:cname="ASSR" edc:nzwidth="0x8" ltx:memberofperipheral="TC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TCR2BUB" edc:desc="Timer/Counter2 Control Register B Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCR2AUB" edc:desc="Timer/Counter2 Control Register A Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCR2BUB" edc:desc="Timer/Counter2 Output Compare Register B Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCR2AUB" edc:desc="Timer/Counter2 Output Compare Register A Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCN2UB" edc:desc="Timer/Counter2 Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS2" edc:desc="Timer/Counter2 Asynchronous Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXCLK" edc:desc="Enable External Clock Input" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXCLKAMR" edc:desc="Enable External Clock Input for AMR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xB7" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xB8" edc:access="nnnnnnnn" edc:cname="TWBR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI"/>
        <edc:SFRDef edc:_addr="0xB9" edc:access="nnnnnnnn" edc:cname="TWSR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWPS" edc:desc="TWI Prescaler Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="16" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="64" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWS" edc:desc="TWI Status" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Bus error due to illegal START or STOP condition." edc:when="(field &amp; 0x1F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="A START condition has been transmitted." edc:when="(field &amp; 0x1F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x10" edc:desc="A repeated START condition has been transmitted." edc:when="(field &amp; 0x1F) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x18" edc:desc="SLA+W has been transmitted; ACK has been received." edc:when="(field &amp; 0x1F) == 0x18"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x20" edc:desc="SLA+W has been transmitted; NOT ACK has been received." edc:when="(field &amp; 0x1F) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x28" edc:desc="Data byte has been transmitted; ACK has been received." edc:when="(field &amp; 0x1F) == 0x28"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x30" edc:desc="Data byte has been transmitted; NOT ACK has been received." edc:when="(field &amp; 0x1F) == 0x30"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x38" edc:desc="Arbitration lost in SLA+W or data bytes (Transmitter); Arbitration lost in SLA+R or NOT ACK bit (Receiver)." edc:when="(field &amp; 0x1F) == 0x38"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x40" edc:desc="SLA+R has been transmitted; ACK has been received." edc:when="(field &amp; 0x1F) == 0x40"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x48" edc:desc="SLA+R has been transmitted; NOT ACK has been received." edc:when="(field &amp; 0x1F) == 0x48"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x50" edc:desc="Data byte has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0x50"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x58" edc:desc="Data byte has been received; NOT ACK has been returned." edc:when="(field &amp; 0x1F) == 0x58"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x60" edc:desc="Own SLA+W has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0x60"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x68" edc:desc="Arbitration lost in SLA+R/W as Master; own SLA+W has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0x68"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x70" edc:desc="General call address has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0x70"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x78" edc:desc="Arbitration lost in SLA+R/W as Master; general call address has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0x78"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x80" edc:desc="Previously addressed with own SLA+W; data has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0x80"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x88" edc:desc="Previously addressed with own SLA+W; data has been received; NOT ACK has been returned." edc:when="(field &amp; 0x1F) == 0x88"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x90" edc:desc="Previously addressed with general call; data has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0x90"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x98" edc:desc="Previously addressed with general call; data has been received; NOT ACK has been returned." edc:when="(field &amp; 0x1F) == 0x98"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA0" edc:desc="A STOP condition or repeated START condition has been received while still addressed as Slave." edc:when="(field &amp; 0x1F) == 0xA0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA8" edc:desc="Own SLA+R has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0xA8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB0" edc:desc="Arbitration lost in SLA+R/W as Master; own SLA+R has been received; ACK has been returned." edc:when="(field &amp; 0x1F) == 0xB0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB8" edc:desc="Data byte in TWDR has been transmitted; ACK has been received." edc:when="(field &amp; 0x1F) == 0xB8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC0" edc:desc="Data byte in TWDR has been transmitted; NO ACK has been received." edc:when="(field &amp; 0x1F) == 0xC0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC8" edc:desc="Last data byte in TWDR has been transmitted (TWEA = 0); ACK has been received." edc:when="(field &amp; 0x1F) == 0xC8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF8" edc:desc="No relevant state information available; TWINT = 0." edc:when="(field &amp; 0x1F) == 0xF8"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBA" edc:access="nnnnnnnn" edc:cname="TWAR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWGCE" edc:desc="TWI General Call Recognition Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWA" edc:desc="TWI (Slave) Address" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
