BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega128RFA1.PIC
        <edc:SFRDef edc:_addr="0xBB" edc:access="nnnnnnnn" edc:cname="TWDR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI"/>
        <edc:SFRDef edc:_addr="0xBC" edc:access="nnnnnnnn" edc:cname="TWCR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWIE" edc:desc="TWI Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWEN" edc:desc="TWI Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWWC" edc:desc="TWI Write Collision Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSTO" edc:desc="TWI STOP Condition Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSTA" edc:desc="TWI START Condition Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWEA" edc:desc="TWI Enable Acknowledge Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWINT" edc:desc="TWI Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBD" edc:access="nnnnnnnn" edc:cname="TWAMR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWAM" edc:desc="TWI Address Mask" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xBE" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xC0" edc:access="nnn-----" edc:cname="UCSR0A" edc:nzwidth="0x8" ltx:memberofperipheral="USART0_SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="UDRE0" edc:desc="USART Data Register Empty" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXC0" edc:desc="USART Transmit Complete" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXC0" edc:desc="USART Receive Complete" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC1" edc:access="nnnnn---" edc:cname="UCSR0B" edc:nzwidth="0x8" ltx:memberofperipheral="USART0_SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="TXEN0" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEN0" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRIE0" edc:desc="USART Data Register Empty Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIE0" edc:desc="TX Complete Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIE0" edc:desc="RX Complete Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC2" edc:access="-----nnn" edc:cname="UCSR0C" edc:nzwidth="0x8" ltx:memberofperipheral="USART0_SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCPOL0" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCPHA0" edc:desc="Clock Phase" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDORD0" edc:desc="Data Order" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xC3" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xC4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UBRR0" edc:nzwidth="0x10" ltx:memberofperipheral="USART0"/>
        <edc:SFRDef edc:_addr="0xC6" edc:access="nnnnnnnn" edc:cname="UDR0" edc:nzwidth="0x8" ltx:memberofperipheral="USART0"/>
        <edc:AdjustPoint edc:_addr="0xC7" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xC8" edc:access="nnn-----" edc:cname="UCSR1A" edc:nzwidth="0x8" ltx:memberofperipheral="USART1_SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="UDRE1" edc:desc="USART Data Register Empty" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXC1" edc:desc="USART Transmit Complete" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXC1" edc:desc="USART Receive Complete" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC9" edc:access="nnnnn---" edc:cname="UCSR1B" edc:nzwidth="0x8" ltx:memberofperipheral="USART1_SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEN1" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRIE1" edc:desc="USART Data Register Empty Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIE1" edc:desc="TX Complete Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIE1" edc:desc="RX Complete Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCA" edc:access="-----nnn" edc:cname="UCSR1C" edc:nzwidth="0x8" ltx:memberofperipheral="USART1_SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCPOL1" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCPHA1" edc:desc="Clock Phase" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDORD1" edc:desc="Data Order" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xCB" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xCC" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UBRR1" edc:nzwidth="0x10" ltx:memberofperipheral="USART1"/>
        <edc:SFRDef edc:_addr="0xCE" edc:access="nnnnnnnn" edc:cname="UDR1" edc:nzwidth="0x8" ltx:memberofperipheral="USART1"/>
        <edc:AdjustPoint edc:_addr="0xCF" edc:offset="0xD"/>
        <edc:SFRDef edc:_addr="0xDC" edc:access="nnnnnnnn" edc:cname="SCCR0" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCMP" edc:desc="Symbol Counter Compare Unit 3 Mode select" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="SCTSE" edc:desc="Symbol Counter Automatic Timestamping enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCCKSEL" edc:desc="Symbol Counter Clock Source select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCEN" edc:desc="Symbol Counter enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCMBTS" edc:desc="Manual Beacon Timestamp" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCRES" edc:desc="Symbol Counter Synchronization" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDD" edc:access="nnnnnnnn" edc:cname="SCCR1" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCENBO" edc:desc="Backoff Slot Counter enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
