BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega128RFA1.PIC
        <edc:SFRDef edc:_addr="0xEC" edc:access="nnnnnnnn" edc:cname="SCTSRHH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSRHH" edc:desc="Symbol Counter Frame Timestamp Register HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="nnnnnnnn" edc:cname="SCOCR3LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3LL" edc:desc="Symbol Counter Output Compare Register 3 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnnnnnnn" edc:cname="SCOCR3LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3LH" edc:desc="Symbol Counter Output Compare Register 3 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="nnnnnnnn" edc:cname="SCOCR3HL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3HL" edc:desc="Symbol Counter Output Compare Register 3 HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nnnnnnnn" edc:cname="SCOCR3HH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3HH" edc:desc="Symbol Counter Output Compare Register 3 HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="SCOCR2LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2LL" edc:desc="Symbol Counter Output Compare Register 2 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnn" edc:cname="SCOCR2LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2LH" edc:desc="Symbol Counter Output Compare Register 2 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF3" edc:access="nnnnnnnn" edc:cname="SCOCR2HL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2HL" edc:desc="Symbol Counter Output Compare Register 2 HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnn" edc:cname="SCOCR2HH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2HH" edc:desc="Symbol Counter Output Compare Register 2 HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF5" edc:access="nnnnnnnn" edc:cname="SCOCR1LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1LL" edc:desc="Symbol Counter Output Compare Register 1 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnn" edc:cname="SCOCR1LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1LH" edc:desc="Symbol Counter Output Compare Register 1 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF7" edc:access="nnnnnnnn" edc:cname="SCOCR1HL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1HL" edc:desc="Symbol Counter Output Compare Register 1 HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF8" edc:access="nnnnnnnn" edc:cname="SCOCR1HH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1HH" edc:desc="Symbol Counter Output Compare Register 1 HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF9" edc:offset="0x27"/>
        <edc:SFRDef edc:_addr="0x120" edc:access="nnnnnnnn" edc:cname="TCCR5A" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WGM5" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Normal mode of operation" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="PWM, phase correct, 8-bit" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="PWM, phase correct, 9-bit" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x3" edc:desc="PWM, phase correct, 10-bit" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="Fast PWM, 8-bit" edc:when="(field &amp; 0x3) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Fast PWM, 9-bit" edc:when="(field &amp; 0x3) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Fast PWM, 10-bit" edc:when="(field &amp; 0x3) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x8" edc:desc="PWM, Phase and frequency correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x9" edc:desc="PWM, Phase and frequency correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA" edc:desc="PWM, Phase correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xA"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB" edc:desc="PWM, Phase correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xB"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xC"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xD" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0xD"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="Fast PWM, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Fast PWM, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM5C" edc:desc="Compare Output Mode for Channel C" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM5B" edc:desc="Compare Output Mode for Channel B" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM5A" edc:desc="Compare Output Mode for Channel A" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x121" edc:access="nnnnnnnn" edc:cname="TCCR5B" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS5" edc:desc="Clock Select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No clock source (Timer/Counter stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="clk_IO/1 (no prescaling)" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="clk_IO/8 (from prescaler)" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="clk_IO/64 (from prescaler)" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="clk_IO/256 (from prescaler)" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="clk_IO/1024 (from prescaler)" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WGM5" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Normal mode of operation" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="PWM, phase correct, 8-bit" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="PWM, phase correct, 9-bit" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x3" edc:desc="PWM, phase correct, 10-bit" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="Fast PWM, 8-bit" edc:when="(field &amp; 0x3) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Fast PWM, 9-bit" edc:when="(field &amp; 0x3) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Fast PWM, 10-bit" edc:when="(field &amp; 0x3) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x8" edc:desc="PWM, Phase and frequency correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x9" edc:desc="PWM, Phase and frequency correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA" edc:desc="PWM, Phase correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xA"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB" edc:desc="PWM, Phase correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xB"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xC"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xD" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0xD"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="Fast PWM, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Fast PWM, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES5" edc:desc="Input Capture 5 Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC5" edc:desc="Input Capture 5 Noise Canceller" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
