BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega128RFA1.PIC
        <edc:SFRDef edc:_addr="0x122" edc:access="nnnnnnnn" edc:cname="TCCR5C" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="FOC5C" edc:desc="Force Output Compare for Channel C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC5B" edc:desc="Force Output Compare for Channel B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC5A" edc:desc="Force Output Compare for Channel A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x123" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x124" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT5" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x126" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR5" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x128" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5A" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x12A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5B" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x12C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5C" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:AdjustPoint edc:_addr="0x12E" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x12F" edc:access="nnnnnnnn" edc:cname="LLCR" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LLENCAL" edc:desc="Enable Automatic Calibration" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLSHORT" edc:desc="Short Lower Calibration Circuit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLTCO" edc:desc="Temperature Coefficient of Current Source" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLCAL" edc:desc="Calibration Active" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLCOMP" edc:desc="Comparator Output" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLDONE" edc:desc="Calibration Done" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x130" edc:access="nnnnnnnn" edc:cname="LLDRL" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LLDRL" edc:desc="Low-Byte Data Register Bits" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Calibration limit for fast process corner/high output voltage" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="Calibration limit for slow process corner/low output voltage" edc:when="(field &amp; 0xF) == 0x08"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x131" edc:access="nnnnnnnn" edc:cname="LLDRH" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LLDRH" edc:desc="High-Byte Data Register Bits" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Calibration limit for fast process corner/high output voltage" edc:when="(field &amp; 0x1F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x10" edc:desc="Calibration limit for slow process corner/low output voltage" edc:when="(field &amp; 0x1F) == 0x10"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x132" edc:access="nnnn----" edc:cname="DRTRAM3" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ENDRT" edc:desc="Enable SRAM Data Retention" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DRTSWOK" edc:desc="DRT Switch OK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x133" edc:access="-nnn----" edc:cname="DRTRAM2" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ENDRT" edc:desc="Enable SRAM Data Retention" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DRTSWOK" edc:desc="DRT Switch OK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x134" edc:access="nnnn----" edc:cname="DRTRAM1" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ENDRT" edc:desc="Enable SRAM Data Retention" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DRTSWOK" edc:desc="DRT Switch OK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x135" edc:access="nnnn----" edc:cname="DRTRAM0" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ENDRT" edc:desc="Enable SRAM Data Retention" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DRTSWOK" edc:desc="DRT Switch OK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x136" edc:access="nnnnnnnn" edc:cname="DPDS0" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PBDRV" edc:desc="Driver Strength Port B" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PDDRV" edc:desc="Driver Strength Port D" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PEDRV" edc:desc="Driver Strength Port E" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFDRV" edc:desc="Driver Strength Port F" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x137" edc:access="nnnnnnnn" edc:cname="DPDS1" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PGDRV" edc:desc="Driver Strength Port G" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x138" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x139" edc:access="nnnn--nn" edc:cname="TRXPR" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRXRST" edc:desc="Force Transceiver Reset" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLPTR" edc:desc="Multi-purpose Transceiver Control Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x13A" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x13C" edc:access="n-n-nn--" edc:cname="AES_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="AES_IM" edc:desc="AES Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_DIR" edc:desc="Set AES Operation Direction" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AES_DIR_ENC" edc:desc="AES operation is encryption." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AES_DIR_DEC" edc:desc="AES operation is decryption." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_MODE" edc:desc="Set AES Operation Mode" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AES_MODE_ECB" edc:desc="AES Mode is ECB (Electronic Code Book)." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AES_MODE_CBC" edc:desc="AES Mode is CBC (Cipher Block Chaining)." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_REQUEST" edc:desc="Request AES Operation." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
