BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega128RFA1.PIC
        <edc:SFRDef edc:_addr="0x152" edc:access="nnnnnnnn" edc:cname="XOSC_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XTAL_TRIM" edc:desc="Crystal Oscillator Load Capacitance Trimming" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="XTAL_TRIM_MIN" edc:desc="0.0 pF, trimming capacitors disconnected" edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="0.3 pF, trimming capacitor switched on" edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="..." edc:when="(field &amp; 0xF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="XTAL_TRIM_MAX" edc:desc="4.5 pF, trimming capacitor switched on" edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="XTAL_MODE" edc:desc="Crystal Oscillator Operating Mode" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="Internal crystal oscillator disabled; use external reference frequency." edc:when="(field &amp; 0xF) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Internal crystal oscillator enabled; amplitude regulation of oscillation enabled." edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x153" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x155" edc:access="nnnnnnnn" edc:cname="RX_SYN" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX_PDT_LEVEL" edc:desc="Reduce Receiver Sensitivity" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="RX_PDT_LEVEL_MIN" edc:desc="RX_THRES ≤ RSSI_BASE_VAL (Reset value); RSSI value not considered" edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="RX_THRES &gt; RSSI_BASE_VAL + 0 · 3; RSSI &gt; -90 dBm" edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="..." edc:when="(field &amp; 0xF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="RX_THRES &gt; RSSI_BASE_VAL + 13 · 3; RSSI &gt; -51 dBm" edc:when="(field &amp; 0xF) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="RX_PDT_LEVEL_MAX" edc:desc="RX_THRES &gt; RSSI_BASE_VAL + 14 · 3; RSSI &gt; -48 dBm" edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="RX_PDT_DIS" edc:desc="Prevent Frame Reception" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x156" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x157" edc:access="--nn-nn-" edc:cname="XAH_CTRL_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_PROM_MODE" edc:desc="Enable Promiscuous Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_ACK_TIME" edc:desc="Reduce Acknowledgment Time" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AACK_ACK_TIME_12_SYM" edc:desc="12 symbols acknowledgment time" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AACK_ACK_TIME_2_SYM" edc:desc=" 2 symbols acknowledgment time" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_UPLD_RES_FT" edc:desc="Process Reserved Frames" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_FLTR_RES_FT" edc:desc="Filter Reserved Frames" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x158" edc:access="n-------" edc:cname="FTN_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="FTN_START" edc:desc="Start Calibration Loop of Filter Tuning Network" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x159" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x15A" edc:access="n-------" edc:cname="PLL_CF" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="PLL_CF_START" edc:desc="Start Center Frequency Calibration" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15B" edc:access="n-------" edc:cname="PLL_DCU" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="PLL_DCU_START" edc:desc="Start Delay Cell Calibration" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15C" edc:access="nnnnnnnn" edc:cname="PART_NUM" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PART_NUM" edc:desc="Part Number" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="P_ATmega128RFA1" edc:desc="ATmega128RFA1 part number" edc:when="(field &amp; 0xFF) == 0x83"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15D" edc:access="nnnnnnnn" edc:cname="VERSION_NUM" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VERSION_NUM" edc:desc="Version Number" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="REV_A" edc:desc="Revision A" edc:when="(field &amp; 0xFF) == 2"/>
                <edc:SFRFieldSemantic edc:cname="REV_B" edc:desc="Revision B" edc:when="(field &amp; 0xFF) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15E" edc:access="nnnnnnnn" edc:cname="MAN_ID_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAN_ID_00" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="ATMEL_BYTE_0" edc:desc="Atmel JEDEC manufacturer ID, bits [7:0] of 32 bit manufacturer ID: 00 00 00 1F" edc:when="(field &amp; 0x1) == 0x1f"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MAN_ID_01" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_02" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_03" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_04" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_05" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_06" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_07" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15F" edc:access="nnnnnnnn" edc:cname="MAN_ID_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAN_ID_" edc:desc="Manufacturer ID (High Byte)" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="ATMEL_BYTE_1" edc:desc="Atmel JEDEC manufacturer ID, bits [15:8] of 32 bit manufacturer ID: 00 00 00 1F" edc:when="(field &amp; 0xFF) == 0x00"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
