BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega128RFA1.PIC
        <edc:SFRDef edc:_addr="0x160" edc:access="nnnnnnnn" edc:cname="SHORT_ADDR_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_00" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_01" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_02" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_03" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_04" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_05" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_06" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_07" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x161" edc:access="nnnnnnnn" edc:cname="SHORT_ADDR_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_" edc:desc="MAC Short Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x162" edc:access="nnnnnnnn" edc:cname="PAN_ID_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PAN_ID_00" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_01" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_02" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_03" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_04" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_05" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_06" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_07" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x163" edc:access="nnnnnnnn" edc:cname="PAN_ID_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PAN_ID_" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x164" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_00" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_01" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_02" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_03" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_04" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_05" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_06" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_07" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x165" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x166" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_2" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x167" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_3" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x168" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_4" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x169" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_5" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
