BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega128RFA1.PIC
        <edc:SFRDef edc:_addr="0x16A" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_6" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16B" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_7" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16C" edc:access="nnnnnnnn" edc:cname="XAH_CTRL_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLOTTED_OPERATION" edc:desc="Set Slotted Acknowledgment" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="SLOTTED_OP_DIS" edc:desc="The radio transceiver operates in unslotted mode. An acknowledgment frame is automatically sent if requested." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="SLOTTED_OP_EN" edc:desc="The transmission of an acknowledgment frame has to be controlled by the microcontroller." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MAX_CSMA_RETRIES" edc:desc="Maximum Number of CSMA-CA Procedure Repetition Attempts" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="No repetition of CSMA-CA procedure" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="One repetition of CSMA-CA procedure" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="..." edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="Five repetitions (highest IEEE 802.15.4 compliant value)" edc:when="(field &amp; 0x7) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Immediate frame re-transmission without performing CSMA-CA" edc:when="(field &amp; 0x7) == 0x7"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MAX_FRAME_RETRIES" edc:desc="Maximum Number of Frame Re-transmission Attempts" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Retransmission of frame is not attempted." edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="Retransmission of frame is attempted once." edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="..." edc:when="(field &amp; 0xF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Retransmission of frame is attempted 15 times." edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16D" edc:access="nnnnnnnn" edc:cname="CSMA_SEED_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSMA_SEED_00" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_01" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_02" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_03" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_04" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_05" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_06" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_07" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16E" edc:access="nnnnnnnn" edc:cname="CSMA_SEED_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSMA_SEED_1" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="AACK_I_AM_COORD" edc:desc="Set Personal Area Network Coordinator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_DIS_ACK" edc:desc="Disable Acknowledgment Frame Transmission" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_SET_PD" edc:desc="Set Frame Pending Sub-field" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_FVN_MODE" edc:desc="Acknowledgment Frame Filter Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Acknowledge frames with version number 0" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Acknowledge frames with version number 0 or 1" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Acknowledge frames with version number 0 or 1 or 2" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Acknowledge frames independent of frame version number" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16F" edc:access="nnnnnnnn" edc:cname="CSMA_BE" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MIN_BE" edc:desc="Minimum Back-off Exponent" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Minimum value of minimum back-off exponent." edc:when="(field &amp; 0xF) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="..." edc:when="(field &amp; 0xF) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_8" edc:desc="Maximum value of minimum back-off exponent. MIN_BE must be smaller or equal to MAX_BE." edc:when="(field &amp; 0xF) == 8"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MAX_BE" edc:desc="Maximum Back-off Exponent" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="This value is not valid for the maximum back-off exponent." edc:when="(field &amp; 0xF) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="This value is not valid for the maximum back-off exponent." edc:when="(field &amp; 0xF) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Minimum, IEEE compliant value for the maximum back-off exponent." edc:when="(field &amp; 0xF) == 3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_4" edc:desc="..." edc:when="(field &amp; 0xF) == 4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_8" edc:desc="Maximum, IEEE compliant value for the maximum back-off exponent." edc:when="(field &amp; 0xF) == 8"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x170" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0x176" edc:access="----nnnn" edc:cname="TST_CTRL_DIGI" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TST_CTRL_DIG" edc:desc="Digital Test Controller Register" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="NORMAL (no test is active)" edc:when="(field &amp; 0xF) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_15" edc:desc="TST_CONT_TX (continuous transmit)" edc:when="(field &amp; 0xF) == 15"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x177" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0x17B" edc:access="nnnnnnnn" edc:cname="TST_RX_LENGTH" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX_LENGTH" edc:desc="Received Frame Length" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
